#+SETUPFILE: theme-readtheorg.setup
#+TITLE:     Notes
#+AUTHOR:    Fliar Start
#+EMAIL:     fliar@live.jp
#+OPTIONS: H:5 num:nil toc:3

**** RESTful API basic:get data
	 - simply using curl, add .json to the url address:
	   print=pretty makes it more readable.
	 #+BEGIN_SRC sh
	 curl 'https://xxxxxx.firebaseio.com/pub.json?print=pretty'
	 #+END_SRC

	 #+RESULTS:
	 | {   |   |     |
	 | 1   | : | 99, |
	 | abc | : | aaa |
	 | }   |   |     |
	 - auth param will bypass the rules for db:
	   for instance, if your db secret is 123 (could be found in settings/database),rules for your db is like this:
	   #+BEGIN_SRC json
	   "pub": {
       	".read": false,
       	".write": false,
       },
	   #+END_SRC
	   when executing:
	   #+BEGIN_SRC sh
	   curl 'https://xxxxxx.firebaseio.com/pub.json?auth=123&print=pretty'
	   #+END_SRC

	   #+RESULTS:
	   | {   |   |     |
	   | 1   | : | 99, |
	   | abc | : | aaa |
	   | }   |   |     |
	   your data will show as well
**** show version
	 #+BEGIN_SRC sh
	 lsb_release -a
	 #+END_SRC

	 #+RESULTS:
	 | Distributor ID: | Ubuntu           |
	 | Description:    | Ubuntu 16.04 LTS |
	 | Release:        | 16.04            |
	 | Codename:       | xenial           |

